In [ ]:
import numpy as np
import pandas as pd

In [ ]:
dataset=pd.read_csv('https://github.com/ybifoundation/Dataset/raw/main/Bank%20Churn%20Modelling.csv')

In [ ]:
dataset.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,Num Of Products,Has Credit Card,Is Active Member,Estimated Salary,Churn
0,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CustomerId        10000 non-null  int64
 1   Surname           10000 non-null  object
 2   CreditScore       10000 non-null  int64
 3   Geography         10000 non-null  object
 4   Gender            10000 non-null  object
 5   Age               10000 non-null  int64
 6   Tenure            10000 non-null  int64
 7   Balance           10000 non-null  float64
 8   Num Of Products   10000 non-null  int64
 9   Has Credit Card   10000 non-null  int64
 10  Is Active Member  10000 non-null  int64
 11  Estimated Salary  10000 non-null  float64
 12  Churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(3)
memory usage: 1015.8+ KB

In [ ]:
dataset.Gender.value_counts()

Male      5457
Female    4543
Name: Gender, dtype: int64

In [ ]:
dataset.Surname.value_counts()

Smith       32
Scott       29
Martin      29
Walker      28
Brown       26
            ..
Izmailov     1
Bold         1
Bonham       1
Poninski     1
Burbidge     1
Name: Surname, Length: 2932, dtype: int64

In [ ]:
dataset.Geography.value_counts()

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [ ]:
dataset.columns

Index(['CustomerId', 'Surname', 'CreditScore', 'Geography', 'Gender', 'Age',
       'Tenure', 'Balance', 'Num Of Products', 'Has Credit Card',
       'Is Active Member', 'Estimated Salary', 'Churn'],
      dtype='object')

In [ ]:
X =dataset[[ 'CreditScore', 'Geography', 'Gender', 'Age',
       'Tenure', 'Balance', 'Num Of Products', 'Has Credit Card',
       'Is Active Member', 'Estimated Salary']]

In [ ]:
y = dataset['Churn']

In [ ]:
#Encoding categorical Data 
from sklearn.preprocessing import OrdinalEncoder
oe = OrdinalEncoder()
X[['Gender']]= oe.fit_transform(X[['Gender']])

In [ ]:
X

,CreditScore,Geography,Gender,Age,Tenure,Balance,Num Of Products,Has Credit Card,Is Active Member,Estimated Salary
0,619,France,0.0,42,2,0.00,1,1,1,101348.88
1,608,Spain,0.0,41,1,83807.86,1,0,1,112542.58
2,502,France,0.0,42,8,159660.80,3,1,0,113931.57
3,699,France,0.0,39,1,0.00,2,0,0,93826.63
4,850,Spain,0.0,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...,...,...
9995,771,France,1.0,39,5,0.00,2,1,0,96270.64
9996,516,France,1.0,35,10,57369.61,1,1,1,101699.77
9997,709,France,0.0,36,7,0.00,1,0,1,42085.58
9998,772,Germany,1.0,42,3,75075.31,2,1,0,92888.52
9999,792,France,0.0,28,4,130142.79,1,1,0,38190.78

In [ ]:
X =pd.get_dummies(X,columns=['Geography'])

In [ ]:
X

,CreditScore,Gender,Age,Tenure,Balance,Num Of Products,Has Credit Card,Is Active Member,Estimated Salary,Geography_France,Geography_Germany,Geography_Spain
0,619,0.0,42,2,0.00,1,1,1,101348.88,1,0,0
1,608,0.0,41,1,83807.86,1,0,1,112542.58,0,0,1
2,502,0.0,42,8,159660.80,3,1,0,113931.57,1,0,0
3,699,0.0,39,1,0.00,2,0,0,93826.63,1,0,0
4,850,0.0,43,2,125510.82,1,1,1,79084.10,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,1.0,39,5,0.00,2,1,0,96270.64,1,0,0
9996,516,1.0,35,10,57369.61,1,1,1,101699.77,1,0,0
9997,709,0.0,36,7,0.00,1,0,1,42085.58,1,0,0
9998,772,1.0,42,3,75075.31,2,1,0,92888.52,0,1,0
9999,792,0.0,28,4,130142.79,1,1,0,38190.78,1,0,0

encoding and missing value always before the train test split

Scailing is always after train test split bcz if we dont do that data leakage will occur

In [ ]:
#splittiing dataset for training and testing 
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.8,random_state=2529)

In [ ]:
#feature scailing
from sklearn.preprocessing import StandardScaler
sc =StandardScaler()
X_train=sc.fit_transform(X_train)
X_test=sc.fit_transform(X_test)

In [ ]:
X_train.shape

(2000, 12)

In [ ]:
X.shape

(10000, 12)

In [ ]:
y.shape

(10000,)

Neural ntw model

In [ ]:
from keras.models import Sequential
from keras.layers import Dense

In [ ]:
# initalize the constructor 
ann = Sequential()

In [ ]:
#adding the input layer and 1 st hidden layer 
ann.add(Dense(12,activation='relu'))

In [ ]:
#adding the 2 nd hidden layer 
ann.add(Dense(10,activation='relu'))

In [ ]:
#adding the output layer 
ann.add(Dense(1,activation='sigmoid'))

In [ ]:
#compiling the ann
ann.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accurcay'])

In [ ]:
#training the ann on the training set 
ann.fit(X_train,y_train, batch_size=32, epochs=10, verbose=1)

In [ ]:
ann.summary()

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 dense (Dense)               (None, 12)                156

 dense_1 (Dense)             (None, 10)                130

 dense_2 (Dense)             (None, 1)                 11

=================================================================
Total params: 297
Trainable params: 297
Non-trainable params: 0
_________________________________________________________________